[
  {
    "image": "assets/images/byborg.png",
    "name": "Byborg<br/><span class=\"smaller\">Staff Software Engineer</span>",
    "date": "2024 - present",
    "description": "Not only writing code and solving isolated problems, but if needed, working in cross team collaboration, drive initiatives, break down complex requirements into tasks and act as a technical bridge between business requirements and technical implementation, leading front-end development using React, TypeScript and Next.js - optimizing for server-side rendering, speed, and user experience."
  },
  {
    "image": "assets/images/lastpass.png",
    "name": "LastPass<br/><span class=\"smaller\">Senior Software Engineer</span>",
    "date": "2022 - 2024",
    "description": "Gained some in-depth knowledge of the front-end side development, from vanilla js through frameworks. Learned more about working in a team, and how to push the product further, to help be better. Beyond technical experience, I've honed my team collaboration skills, understanding how collective efforts drive product enhancement and continual progression."
  },
  {
    "image": "assets/images/lastpass.png",
    "name": "LastPass<br/><span class=\"smaller\">Software Engineer</span>",
    "date": "2020 - 2022",
    "description": "Engaged in a significant React-driven large-scale project, alongside fundamental technologies, contributing to feature implementation and bug resolution across web applications and browser extensions."
  },
  {
    "image": "assets/images/epam.png",
    "name": "Epam Systems<br/><span class=\"smaller\">Software Engineer</span>",
    "date": "2018 - 2020",
    "description": "Within an enterprise-level project, I demonstrated dedication to feature development, bug fixing, and upholding code quality on a daily basis. My involvement in a large-scale project equipped me with invaluable experience, allowing me to seamlessly blend core technologies with frameworks."
  },
  {
    "image": "assets/images/epam.png",
    "name": "Epam Systems<br/><span class=\"smaller\">Junior Software Engineer</span>",
    "date": "2017 - 2018",
    "description": "Learned and used new programming patterns and techniques, new technologies, programming SPA-s and PWA-s (Angular 2+, React), and Node.js, working with Git, Jira, Webstorm, etc. Also, daily use of core technologies, like JavaScript (ES6), CSS, and HTML."
  },
  {
    "image": "assets/images/litologo.png",
    "name": "Litofilm<br/><span class=\"smaller\">Web Developer</span>",
    "date": "2015 - 2017",
    "description": "From scratch, I developed web sites for over two years. We had a web designer who made the design by the wishes of the client, I held together each project, contact the client, manage the work process, write the code (mostly client side), find a freelancer to write the back-end part of the code (if necessary), performed manual functional testing then finalize the deal with the client when the product was ready."
  },
  {
    "image": "assets/images/telekom.png",
    "name": "Magyar Telekom<br/><span class=\"smaller\">Customer service representative</span>",
    "date": "2012 - 2015",
    "description": "Supporting company sales and/or customer services efforts by solving clients' problems, helping to get answers, and managing conflicts. Later I was involved in working with the receivables management team."
  },
  {
    "image": "assets/images/lombard.png",
    "name": "Lombard Lízing<br/><span class=\"smaller\">Customer service representative</span>",
    "date": "2010 - 2012 ",
    "description": "Supporting company sales and/or customer services efforts by taking care of the client's problems, helping them with their issues with the contracts, give information when the clients needed."
  },
  {
    "image": "assets/images/otp.png",
    "name": "OTP Bank<br/><span class=\"smaller\">Customer service representative</span>",
    "date": "2009 - 2010",
    "description": "Supporting company sales and/or customer services efforts by dealing with a breach of contract, accepting a payment agreement with non-paying customers, and initiating a recovery if necessary."
  }
]
