[
  {
    "image": "assets/images/epam.png",
    "name": "Epam Systems<br/><span class=\"smaller\">Software Developer</span>",
    "date": "2018 - present",
    "description": "Developing features, fixing bugs, maintain code quality on daily basis on an enterprise level project."
  },
  {
    "image": "assets/images/epam.png",
    "name": "Epam Systems<br/><span class=\"smaller\">Junior Software Developer</span>",
    "date": "2017 - 2018",
    "description": "Learned and using new programming patterns and techniques, new technologies, programming SPA-s and PWA-s (Angular 2+, React), and Node.js, working with Git, Jira, Webstorm, etc. Also, daily use of the core technologies, like JavaScript (ES6), CSS and HTML. "
  },
  {
    "image": "assets/images/litologo.png",
    "name": "Litofilm<br/><span class=\"smaller\">Web Developer</span>",
    "date": "2015 - 2017",
    "description": "From scratch I developed web sites for over two years. We had a web designer who made the design by the wishes of the client, I hold together each project, contact the client, manage the work process, write the code (mostly client side), find a freelancer to write the back-end part of the code (if necessary), performed manual functional testing then finalize the deal with the client, when the product was ready."
  },
  {
    "image": "assets/images/telekom.png",
    "name": "Magyar Telekom<br/><span class=\"smaller\">Customer service representative</span>",
    "date": "2012 - 2015",
    "description": "Supporting company sales and/or customer services efforts by solving clients problems, help to get answers, and manage conflicts. Later I involved in working with the receivables management team."
  },
  {
    "image": "assets/images/lombard.png",
    "name": "Lombard Lízing<br/><span class=\"smaller\">Customer service representative</span>",
    "date": "2010 - 2012 ",
    "description": "Supporting company sales and/or customer services efforts by taking cafe of the clients problems, help them with their issues with the contrats, give information when the clients needed."
  },
  {
    "image": "assets/images/otp.png",
    "name": "OTP Bank<br/><span class=\"smaller\">Customer service representative</span>",
    "date": "2009 - 2010",
    "description": "Supporting company sales and/or customer services efforts by dealing with a breach of contract, accepting a payment agreement with non-paying customers, initiating a recovery if necessary."
  }
]
